package OOP;

/*
 * 类是现实生活中一类有共同属性和行为的事物的抽象
 *   类是对象的抽象
 *   对象是类的实体
 *
 * 类的特点:
 *      - 类是对象的数据类型
 *      - 类是具有相同属性和行为的一组对象的集合
 *
 *
 *                    成员变量              局部变量
 *      类中位置      类中方法外           方法内或方法声明上
 *      内存位置      堆内存               栈内存
 *      生命周期      随对象存在和消失     随方法调用存在和消失
 *      初始化值      有默认初始化值       没有默认的初始化值，必须定义、赋值才能使用
 *
 * 封装：
 *      原则：将类的某些信息隐藏在类内部，不允许外界直接访问，而是通过该类提供的方法来实现对隐藏信息的操作和访问
 *      如private变量 有对应的get/set方法
 *      好处：安全性、复用性
 *
 *
 *
 */
public class Demo01 {
    public static void main(String[] args) {

    }
}
